Revit 2024 API
Application.NewViewSet Method
Creates a new instance of a View set.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ViewSet NewViewSet()
Visual Basic
Public Function NewViewSet As ViewSet
Visual C++
public:
ViewSet^ NewViewSet()
See Also
Application Class
Autodesk.Revit.Creation Namespace